singlePhase_case/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      snappyHexMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh true;
snap            true;
addLayers       false; // no bed/sediment layer generation

// Geometry
geometry
{
    pier
    {
        type searchableCylinder;
        // Define pier approximately spanning the vertical domain (adjust if needed)
        point1 (0 0 -0.01);
        point2 (0 0  0.06);
        radius 0.02; // D = 0.04 m
    }
}

// Castellated mesh controls
castellatedMeshControls
{
    maxLocalCells  3000000;
    maxGlobalCells 10000000;

    minRefinementCells 10;
    maxLoadUnbalance 0.10;

    nCellsBetweenLevels 5;

    features
    (
    );

    refinementSurfaces
    {
        // Refine only on the pier surface (surface-based refinement)
        pier
        {
            level (1 2); // coarse-fine levels (adjust as needed)
            patchInfo
            {
                type wall;
            }
        }
    }

    resolveFeatureAngle 30;

    // No volumetric sediment/bed refinement boxes - only pier surface refinement

    // Must be inside the computational region and outside the pier solid.
    locationInMesh (-0.395 0.00 0.025);

    allowFreeStandingZoneFaces true;
}

// Snap controls
snapControls
{
    nSmoothPatch 5;
    tolerance 1.0;
    nSolveIter 30;
    nRelaxIter 5;
    nFeatureSnapIter 10;
    implicitFeatureSnap true;
    explicitFeatureSnap false;
    multiRegionFeatureSnap false;
}

// Layer controls (disabled)
addLayersControls
{
    relativeSizes true;

    layers
    {
    }

    expansionRatio 1.2;
    finalLayerThickness 0.3;
    minThickness 0.1;

    nGrow 0;
    featureAngle 60;
    slipFeatureAngle 30;

    nRelaxIter 5;
    nSmoothSurfaceNormals 1;
    nSmoothNormals 3;
    nSmoothThickness 10;

    maxFaceThicknessRatio 0.5;
    maxThicknessToMedialRatio 0.3;
    minMedianAxisAngle 90;

    nBufferCellsNoExtrude 0;
    nLayerIter 50;
}

// Mesh quality controls
meshQualityControls
{
    maxNonOrtho 65;
    maxBoundarySkewness 20;
    maxInternalSkewness 4;
    maxConcave  70;

    minVol          1e-13;
    minTetQuality   1e-15;
    minArea         -1;
    minTwist        0.02;
    minDeterminant  0.001;
    minFaceWeight   0.02;
    minVolRatio     0.01;
    minTriangleTwist -1;

    nSmoothScale 4;
    errorReduction 0.75;

    relaxed
    {
        maxNonOrtho 75;
    }
}

// Advanced
debug 0;

mergeTolerance 1e-6;

// ************************************************************************* //
