singlePhase_case/0/epsilon
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2506                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      epsilon;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -3 0 0 0 0];

internalField   uniform 0.0104;  // epsilon = Cmu * k^2 / nu, 작은 값에서 시작

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 0.0104;
    }

    outlet
    {
        type            zeroGradient;
    }

    bottomWall
    {
        type            epsilonWallFunction;
        value           uniform 0.0104;
    }

    topWall
    {
        type            epsilonWallFunction;
        value           uniform 0.0104;
    }

    sides
    {
        type            epsilonWallFunction;
        value           uniform 0.0104;
    }
}

// ************************************************************************* //
